
const cities =["الدار البيضاء","مراكش","الرباط","فاس","طنجة","أغادير","مكناس","وجدة","القنيطرة","السلا", "تطوان","بني ملال","الناظور","سلا","الحسيمة","تازة","الخريبكة","ورزازات","العيون","خنيفرة","الجديدة","تيفلت","الرشيدية","العرائش","القصر الكبير","الداخلة","تاوريرت","بركان","آسفي"];
const addresses =["  9 فاس  22 ,الدار البيضاء",
" 12c مراكش 9 فاس  ","  9 فاس  07 الرباط"," 9 فاس   9 فاس  9 فاس "    ," 9 فاس  01 طنجة"," 9 فاس 67 أغادير"," 9 فاس 44 مكناس","98 وجدة",
"66 القنيطرة",
"99 السلا",
 "09  9 فاس  تطوان",
 "32  9 فاس  بني ملال","89  9 فاس الناظور"," 78 9 فاس  سلا","99  9 فاس الحسيمة","34 9 فاس  تازة","98 الخريب 9 فاس  كة","12 ورزازات","09 العيون",
 "11 خنيفرة 9 فاس  "," 04  9 فاس  الجديدة"," 78  9 فاس  تيفلت","12  9 فاس  الرشيدية","  9 فاس  40 العرائش","99 القصر الكبير",
 "11  9 فاس  الداخلة","09  9 فاس  تاوريرت","88  9 فاس بركان","56  9 فاس  آسفي"];

const firstNames = ["محمد","عبد الله","فاطمة","عائشة","أمين","زينب","يوسف","سعيد","سلمى","رشيد","مريم","خديجة","عمر","نور","سفيان","فاطمة الزهراء","رضوان","سليمان","لمى","أحمد","ليلى","خالد","إيمان","ياسين","زهراء","إسراء","رشيدة","سامية","حسن","عائشة","حسين","ملك","عبد الرحمن","نور الدين","نادية","عبد العزيز","خديجة","إلهام","منى","فريد","أسماء","سمير","لطيفة","زكرياء","نسيم","حسام","أميمة","يونس","نوال","عبد المجيد","هالة","سامي","سارة","مصطفى","ربيع","فادية","عادل","لطيف","لمياء","سعيدة","بلقيس","محمود","فاطمة النساء","صالح","حفصة","عبد الحفيظ","فريحة","منير","أمينة","سمية","فهد","إسلام","حسينة","زهراء","مصطفى","نعيمة","حسيبة","أحمد الرشيد","نورية","عبد الوهاب","خديجة","فتيحة","جواد","فريدة","محمد الأمين","فؤاد","رقية","مهدي","لينا","إسماعيل","أسماء الله","محمد الحسن","زياد","نعيم","إلهان","صلاح","زكرياء","خيرة","معاذ","فرح","لبنى","إسماعيل","سامر","سلوى","سفيان","أماني","أدهم","إسلام","ندى","فهيمة","علي","ريم","حكيم","سهام","إسراء","إيهاب","حبيب","حياة","لطيفة","أحمد السيد","خالد","رانيا","باسم","فاطمة الزهراء","ريان","لمى","زهرة","أماني","عبد القادر","راشد","نادية","نسرين","عبد الرؤوف","سارة","يوسف","سلمان","رحمة","رضا","ليلى","ميمونة","عبد الرحمان","فتحي","فاطمة السيد","حنان","خالد","حسان","مريم","سمية","رشيد","إكرام","خالد"];

const lastNames = [
    "عبدالله", "أحمد", "علي", "خليل", "رحمان", "حسين", "جمال", "خلف", "محمود", "ناصر",
    "فاروق", "عوض", "مصطفى", "سليم", "قاسم", "طه", "جابر", "كريم", "عبدالرحمن", "عادل"
  ];

function generateRandomId() {
  const characters = '0123456789';
  let randomId = '';

  for (let i = 0; i < 2; i++) {
    const randomIndex = Math.floor(Math.random() * characters.length);
    randomId += characters.charAt(randomIndex);
  }
  return randomId;
} ;

function getFNames () {
    return firstNames;
};

function getAdresses () {
  return addresses;
};

function getLNames () {
    return lastNames;
};

function getCities () {
    return cities;
  };

  
module.exports = {generateRandomId,getFNames,getLNames,getCities, getAdresses};